
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 3 to change, 1 to destroy.</code></pre>

* Create
  * module.redis-cache.azurerm_private_endpoint.this[0]
* Update
  * azurerm_key_vault_secret.redis_access_key
  * azurerm_key_vault_secret.redis_connection_string
  * azurerm_resource_group.rg
* Replace
  * module.redis-cache.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "redis_access_key" {
        id                      = "https://ia-aat.vault.azure.net/secrets/ia-redis-access-key/2cf7ec9d9e3c4b0192117615f2dd2999"
        name                    = "ia-redis-access-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.redis_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "redis_connection_string" {
      - content_type            = "" -> null
        id                      = "https://ia-aat.vault.azure.net/secrets/ia-redis-connection-string/1ae4cc7b1b10483c98ad6bdcf19b0f7a"
        name                    = "ia-redis-connection-string"
        tags                    = {}
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-aip-frontend-aat"
        name     = "ia-aip-frontend-aat"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/ia-aip-frontend.git"
          - "application"         = "immigration"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#ia-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2023-06-19T11:43:58Z"
          - "managedBy"           = "Immigration"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.redis-cache.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ia-redis-aat"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ia-redis-cache-aat"
      + subnet_id                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-2-aat"
      + tags                     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/ia-aip-frontend.git"
          + "application"         = "immigration"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#ia-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Immigration"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "redis-endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ia-redis-aat"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "redisCache",
            ]
        }
    }

  # module.redis-cache.azurerm_redis_cache.redis must be replaced
-/+ resource "azurerm_redis_cache" "redis" {
      ~ hostname                      = "ia-redis-aat.redis.cache.windows.net" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-redis-cache-aat/providers/Microsoft.Cache/redis/ia-redis-aat" -> (known after apply)
        name                          = "ia-redis-aat"
      ~ port                          = 6379 -> (known after apply)
      ~ primary_access_key            = (sensitive value)
      ~ primary_connection_string     = (sensitive value)
      ~ private_static_ip_address     = "10.96.135.68" -> (known after apply)
      ~ public_network_access_enabled = true -> false
      ~ redis_version                 = "4.0" -> "6"
      ~ replicas_per_master           = 0 -> (known after apply)
      ~ replicas_per_primary          = 0 -> (known after apply)
      ~ secondary_access_key          = (sensitive value)
      ~ secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
      ~ ssl_port                      = 6380 -> (known after apply)
      - subnet_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-1-aat" -> null # forces replacement
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/ia-aip-frontend.git"
            "application"         = "immigration"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#ia-tech"
            "environment"         = "staging"
            "managedBy"           = "Immigration"
        }
      - tenant_settings               = {} -> null
      - zones                         = [] -> null
        # (7 unchanged attributes hidden)

      ~ redis_configuration {
          - aof_backup_enabled              = false -> null
          ~ maxclients                      = 7500 -> (known after apply)
          - rdb_backup_enabled              = false -> null
          - rdb_backup_frequency            = 0 -> null
          - rdb_backup_max_snapshot_count   = 0 -> null
            # (5 unchanged attributes hidden)
        }

      - timeouts {}
    }

Plan: 2 to add, 3 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":955,"Program":"tfcmt","SHA1":"","Vars":{}} -->